{
    "flashcards": [
        {
            "name": "abandon",
            "definition": "[əˈbændən] ##(1)v. to leave and never return to     (2)v. to give over unrestrainedly ## desert, relinquish  ## The agency was responding to Republican Gov. Chris Sununu's announcement that it was time to abandon the 'flawed project' and has since called on all parties to agree on a plan that has community support."
        },
        {
            "name": "abate",
            "definition": "[əˈbeɪt] ## v. to become weaker    ## mitigate ##    ## After the storm pounded the Texas coast, it crept inland and then stopped moving, as if mired in mud, and its torrential rains are not expected to abate for many days.            "
        },
        {
            "name": "abbreviate",
            "definition": "[əˈbri:vieɪt] ## v. to make shorter    ##    ## The fact that Mr. McConnell felt compelled to actually abbreviate the recess, just days after Republicans were snickering at the very idea, underscored the seriousness of his party’s plight.            "
        },
        {
            "name": "aberration",
            "definition": "[ˌæbəˈreɪʃn] ## n. something that is unusual or unexpected    ## anomaly ##    ## We tend to see any deviation from that pattern as an unfortunate aberration.            "
        },
        {
            "name": "abet",
            "definition": "[ə'bet] ## v. to actively second and encourage       ## instigate ##    ## The researchers theorized that people in power focus so keenly on their own prerogatives that they become oblivious to those around them and that their subordinates, not wanting to provoke the boss, abet this process.            "
        },
        {
            "name": "abeyance",
            "definition": "[ə'beɪəns] ## n. a state of temporary inactivity    ## quiescence ##    ## Prosecutors urged the U.S. Court of Appeals for the 4th Circuit to reject Maureen McDonnell’s call to put her case in abeyance until the Supreme Court can weigh in on her husband’s.            "
        },
        {
            "name": "abnegation",
            "definition": "[ˌæbnɪˈgeɪʃn] ## n. denial especially: self-denial    ##    ## Yet for true global ruination, many other nations would need to abnegate their moral obligation to protect the planet.            "
        },
        {
            "name": "abound",
            "definition": "[əˈbaʊnd] ## v. to be present in large numbers or in great quantity    ## proliferate ##    ## Unsurprisingly, conspiracy theories abounded immediately after the hack.            "
        },
        {
            "name": "abridge",
            "definition": "[ə'brɪdʒ] ## v. to shorten in duration or extent    ##    ## Given the flood of information presented by the mass media, the only way for someone to keep abreast of the news is to rely on abridged accounts            "
        },
        {
            "name": "absolute",
            "definition": "[ˈæbsəlu:t] ## (1) adj. complete and total      ## (2) adj. not limited in any way      ##    ## I’m here to tell you the baseball game that finally shuddered to life was an absolute joy.            "
        },
        {
            "name": "absolve",
            "definition": "[əbˈzɒlv] ## v. to make free from guilt, responsibility, etc.    ## exonerate ##    ## Finding that the phone wasn’t in use at the time wouldn’t necessarily absolve Miller of wrongdoing, but it could lessen the degree of alleged negligence or recklessness in manslaughter.            "
        },
        {
            "name": "absorbing",
            "definition": "[əbˈsɔ:bɪŋ] ## adj. fully taking one’s attention      ##    ## But again, despite this or that puzzler, it was an absorbing evening, with fine singing and arresting moments of theater.            "
        },
        {
            "name": "abstemious",
            "definition": "[əbˈsti:miəs] ## adj. not eating and drinking too much      ## austere, moderate ##    ## She is judged for her abstemious virtue amid carnivorous abundance.            "
        },
        {
            "name": "abstinence",
            "definition": "['æbstɪnəns] ## n. the practice of not doing or having something that is wanted or enjoyable    ##    ## The Church of Jesus Christ of Latter-day Saints has supported the barriers, which coincide with a religious requirement for abstinence from alcohol.            "
        },
        {
            "name": "abstract",
            "definition": "['æbstrækt] ## (1)adj. relating to or involving general ideas or qualities rather than specific people, objects, or actions      ## (2)adj. difficult to understand          ## (3)n. a brief written statement of the main points or facts in a longer report, speech, etc.     ## (4)v. to obtain or remove from a source     ## (5)v. to draw away the attention of       ##  general ##     ##   The show suggests that the rise of abstract art as a paradigm, after the Second World War, opened up possibilities for women, precisely because it masked personal identity."
        },
        {
            "name": "abstruse",
            "definition": "[əbˈstru:s] ## adj. hard to understand      ##  esoteric, arcane, recondite ##     ##  By the time she stepped down, code breaking had become dauntingly computerized and relied on abstruse techniques of higher mathematics."
        },
        {
            "name": "absurd",
            "definition": "[əbˈsɜ:d] ## adj. extremely silly, foolish, or unreasonable     ##      ##  The local population from Brazil to Mexico lives with a level of state-sponsored and social violence that reaches absurd levels."
        },
        {
            "name": "abundance",
            "definition": "[əˈbʌndəns] ## n. a large amount of something    ##  glut ##    ##   The No. 1 reason coal and nuclear power plants are closing is that they are being priced out of the electricity market by an abundance of cheap natural gas pumped from hydraulic fracturing projects.        "
        },
        {
            "name": "abuse",
            "definition": "[əˈbju:s] ## (1)v. to treat in a harsh or harmful way     (2)v. to use wrongly     ## (3)n. a corrupt practice or custom    ##  misuse ##     ##   The United Nations released a report detailing the Burmese government’s human rights abuses against the long-suffering Rohingya Muslim minority in Rakhine state."
        },
        {
            "name": "accelerate",
            "definition": "[əkˈseləreɪt] ## (1)v. to move faster     ## (2)v. to cause to happen sooner or more quickly    ##      ##  The Ozark Radio Network reports that items taken during a search of the home and surrounding area included a meat grinder, a knife and 26 bottles of lye, which can be used to accelerate the breakdown of bodily tissue."
        },
        {
            "name": "accept",
            "definition": "əkˈsept] ## v. to endure without protest or reaction    ##     ##  The angry and even vulgar reaction of the Israeli delegate is reminiscent of a country that is unable to accept that other religions and cultures exist that in these holy lands."
        },
        {
            "name": " accessible",
            "definition": "ək'sɛsəbl] ## adj. capable of being understood or appreciated       ##     ##   According to the terms of the proposed draft order, every taxi in Los Angeles would have to become accessible via a mobile application similar to the ones used by Uber and Lyft."
        },
        {
            "name": "accession",
            "definition": "ækˈseʃn] ## (1)n. the act or process by which someone rises to a powerful and important position     ## (2)n. adherence    ##  acquiescence ##     ##  This week, the magazine publishes Robert A. Caro’s account of Lyndon Johnson’s accession to the Presidency after the assassination of John F. Kennedy."
        },
        {
            "name": " acclaim",
            "definition": "əˈkleɪm] ## v. to praise in a very strong and enthusiastic way    ##  hail ##     ##   In September, 2013, HAIM released its first album, “Days Are Gone,” to acclaim from pop lovers and jaded rockers alike."
        },
        {
            "name": "accommodate",
            "definition": "ə'kɒmədeɪt] ## (1)v. to make fit, suitable, or congruous     (2)v. to make room for    ##      ##  Fewer than 2 in 10 Hispanics age 40 and older say they are very or extremely confident that nursing homes and assisted living facilities can accommodate their cultural needs, according to the poll."
        },
        {
            "name": " accustomed",
            "definition": "ə'kʌstəmd] ## adj. familiar with something so that it seems normal or usual     ##     ##   New Yorkers are accustomed to things disappearing. Every week, it seems, some beloved old diner, art-supply store, or punk den folds, to be supplanted by a CVS"
        }
    ]
}
  

{
    "name": "",
    "definition": ""
},


acerbic
 [əˈsɜ:bɪk] ## adj. expressing harsh or sharp criticism in a clever way     ##  mordant, vitriolic, caustic, cutting, scathing ##    
  However, while Mattis was more diplomatic in his choice of language compared with President Donald Trump’s acerbic style, the implication was clear.
 acknowledge
 [əkˈnɒlɪdʒ] ## (1)v. to say that you accept or do not deny the truth or existence of     (2)v. to regard or describe (someone or something as having or deserving a particular status    ##  concede ##     ##  The ministry also urged Pyongyang to accept talks over its nuclear program and acknowledge that abandoning its nuclear ambitions is the only way to guarantee its security and economic development.
  acquiescence
  [ˌækwiˈesns] ## n. passive assent or agreement without protest    ##  accession ##    ##   It is likely that these numbers are even higher in rural areas where few studies are conducted, few cases reported—either out of fear or in acquiescence to cultural realities.
 activism
 ['æktəvɪzəm] ## n. a doctrine or practice that emphasizes direct vigorous action       ##      ##   Activism, like alcoholism, can distract a writer from the demands of her desk.
 acumen
 [əˈkjumən] ## n. the ability to think clearly and make good decisions    ##  shrewdness ##     ##   The New Jersey governor said that Trump's 'totally genius business acumen' would set him apart from all previous Presidents.
 acute
 [ə'kjut] ## (1)adj. keenly perceptive or discerning      (2)adj. extremely sharp or severe     ##  incisive, severe ##     ##   Aciman’s first novel shows him to be an acute grammarian of desire.
 ad hoc
 [
    ,æd'hɔk] ## (1)adj. fashioned from whatever is immediately available      (2)adj. formed or used for a special purpose     ##      ##   At an ad hoc meeting of the Darfur People’s Association, immigration lawyers help men understand their cases.
 addiction
 [əˈdɪkʃn] ## n. an usually great interest in something or a need to do or have something    ##      ##  One of the most effective ways of treating those addictions is by identifying and removing the catalysts.
  adhere
  [əd'hɪə] ## v. to give support or maintain loyalty    ##     ##  These days, the Fed appears to have come around to the idea that bankers must adhere to all their regulatory requirements, even the ones that come from other regulators.
  admirable
 [ˈædmərəbl] ## adj. deserving to be admired       ##      ##   Notionally, helping Ukraine is admirable, but the lack of public discussion and suddenness of this announcement are worrisome.
 admonish
 [əd'mɑnɪʃ] ## (1)v. to speak to in a way that expresses disapproval or criticism         ## (2)v. to tell or urge to do something    ##  scold ##     ##   The boom is itself ironic, since it follows so close on the heels of last winter's energy crisis, when the Conservative Gov't. had to institute a 3-day workweek, threaten gasoline rationing and admonish, by way of the media, to 'switch off something now.'
 adopt
 [əˈdɒpt] ## (1)v. to take a child of other parents legally as your own child     (2)v. to begin to use or have    ##  foster ##     ##   Instead, they need to adopt smarter strategies that provide more space for floodwaters to seep into the ground and drain away slowly without leaving behind a trail of destruction.
 adroit
 [əˈdrɔɪt] ## adj. very clever or skillful         ##  nimble, dexterous, deft, acumen ##     ##   Some amalgam of fear, anxiety, and a desperate need to conform renders her both a keen observer and an adroit imitator.
 adulation
 [ˌædjuˈleɪʃn] ## n. excessive or slavish admiration or flattery    ##  approbation, sycophant ##     ##   The request for a rapprochement wasn't merely a bid for praise and adulation, although with Trump there is always some of that involved.

  advanced
 [ədˈvɑ:nst] ## adj. being beyond others in progress or ideas     ##      ##   I’ve completed an advanced health directive and given a copy to my palliative-care specialist.
 advantage
 [ədˈvɑ:ntɪdʒ] ## (1)n. a good or desirable quality or feature     (2)n. benefit or gain    ##      ##  The bill would also implement a point system that would rank applicants seeking to come to the U.S. for work and give an advantage to immigrants who already speak English.
  adversarial
  [ˌædvəˈseəriəl] ## adj. involving two people or two sides who oppose each other     ##  antagonistic ##    ##   They use a grand jury, before which testimony is under oath and transcribed, to lock in testimony from more adversarial witnesses.
 adverse
 [ˈædvɜ:s] ## (1)adj. bad or unfavorable      ## (2)adj. acting against or in a contrary direction    ##  unfavorable ##     ##   It funded research at the Wisconsin Alumni Research Foundation and at the Worcester Foundation for Experimental Biology, which managed to find various adverse effects from consumption of cyclamates in rats.
 advocate
 [ˈædvəkeɪt] ## (1)n. a person who argues for or supports a cause or policy      (2)v. to support or argue for    ##      ##   Lydia Guzman, an immigrants-rights advocate in Arizona, heard the news that Donald Trump pardoned Joe Arpaio, the former Maricopa County sheriff, last night.
 aesthetic
 [i:sˈθetɪk] ## (1)adj. of or relating to art or beauty      (2)adj. pleasing in appearance     ##      ##   These people are very clear about their aim of finding work in the industry—the videos they make are calling cards, audition reels. But in this prosaic pursuit they sometimes kick loose aesthetic revelation.
 affable
 [ˈæfəbl] ## adj. friendly and easy to talk to       ##  easygoing, cordial, genteel ##     ##   The most affable character, new to the franchise, is a chimp who, after a long spell in a zoo, speaks English—voiced by Steve Zahn—rather better than he gibbers or howls.
 affiliate
 [ə'fɪlɪet] ## (1)v. to associate as a member         ## (2)n. an organization that is a member of a larger organization      ##      ##   During his first month of affiliate marketing, in February of 2011, Kelly made five thousand dollars.
 affinity
 [əˈfɪnəti] ## (1)n. a feeling of closeness and understanding that someone has for another person because of their similar qualities, ideas, or interests   ##      ## (2)n. likeness based on relationship or causal connection     (3)n. liking for or an attraction to something     ##      ##  Considering local city planners’ apparent affinity toward off-camber turns, oddly-angled intersections, and simply bizarre placement of stoplights, this newest crossover proved to be agile, quick, and confidence-boosting.
  affirm
  [əˈfɜ:m] ## v. to say that something is true in a confident way    ##     ##  He believes that Buddhist doctrine and practice anticipate and affirm the “modular” view of the mind favored by much contemporary cognitive science.
  affluent
  ['æfluənt] ## adj. flowing in abundance     ##     ##  In recent years survivalism has expanded to more affluent quarters, taking root in Silicon Valley and New York City, among technology executives, hedge-fund managers, and others in their economic cohort.
  aggravate
  ['æɡrəvet] ## v. to make more serious or severe    ##  exacerbate ##    ##  Manhattan might aggravate the heck out of a panicky person till they resembled the jangly lines of emotional stress that emanate from a Roz Chast cartoon character in the New Yorker.
  aghast
  [ə'ɡæst] ## adj. shocked and upset     ##     ##  Each time it plays, I am aghast both at the generosity of his words—is there anything anyone ever wants to hear more than “I see you”? to have their presence validated, confirmed?—and at the way he moves.
  alacrity
 [əˈlækrəti] ## n. a quick and cheerful readiness to do something    ##      ##   The Republican senators have submitted their blue slips with alacrity.


alarmist
 [əˈlɑ:mɪst] ## adj. causing unnecessary fear or anxiety that something unpleasant or dangerous is going to happen       ##      ##   May accused Labour and the media of making alarmist claims, and argued weakly about the basic compromises necessary to insure care for an aging population.
 alien
 [ˈeɪliən] ## (1)adj. not familiar or like other things you have known      (2)adj. from another country     ##      ##   Everything there was insultingly new—that is, unfamiliar and alien.
 all-encompassing
 [ɔlɪn’kʌmpəsɪŋ] ## adj.       ##  inclusive ##     ##   For a left-wing protest politician, it is fine, and perhaps even imperative, to have a single, all-encompassing world view.
 all-important
 [
    ,ɔ:lim'pɔ:tənt] ## adj. of the greatest importance       ##      ##   The much longer wait for women than men during an all-important test for entry to the legal profession was obviously unfair.
 alleviate
 [ə'livɪ'et] ## v. to make less painful, difficult, or severe    ##  mitigate ##     ##   Intuition might tell you that, to alleviate that sensation, a designer should open up the area as much as possible.
 allure
 [əˈlʊə] ## (1)v. to entice by charm or attraction     (2)n. power to attract    ##  charm ##     ##   The allure of the musical paradise that Tollett has conjured in the desert helped him sell almost two hundred thousand tickets to last year’s Coachella, over two weekends, grossing ninety-five million dollars.
 alternative
 [ɔ:lˈtɜ:nətɪv] ## (1)adj. offering or expressing a choice       ## (2)n. something that can be chosen instead of something else     ##      ##   The culture industries need to present themselves as the organic alternative, a symbol of status and aspiration
 altruistic
 [ˌæltrʊ'ɪstɪk] ## adj. showing concern for the happiness and welfare of other people rather than for yourself     ##  benevolent ##     ##   Altruistic impulses encourage us to look after our tribe; genocidal ones encourage us to get rid of the neighboring tribe.
 ambivalence
 [æmˈbɪvələns] ## n. simultaneous and contradictory attitudes for feelings toward an object, person, or action    ##      ##  The collection is a portrait of my own incredible ambivalence about the state where I’ve lived for twelve years.
  ameliorate
  [ə'milɪə'ret] ## v. to make better or more tolerable    ##     ##   Contrary to popular perception, our system of taxes and transfers does less to ameliorate inequality than the systems other countries have.
 anachronistic
 [əˌnækrə'nɪstɪk] ## (1)adj. out of date or old-fashioned      ## (2)adj. something that is mistakenly placed in a time where it does not belong in a story, movie, etc.       ##      ##  It wasn’t exactly the time or place for an anachronistic group featuring horns, doo-wop harmonies and a harp blowing frontman to expect any kind of chart success.
  analogous
 [əˈnæləgəs] ## adj. similar in some way     ##  comparable ##     ##   Still, most researchers stop short of suggesting direct payments to factory owners, analogous to the ones farmers receive.
 analytical
 [ˌænəˈlɪtɪkl] ## adj. doing something involves the use of logical reasoning              ##  dispassionate ##     ##   Moreau was an ideal actress for such analytical directors as Michelangelo Antonioni and Joseph Losey, whose dramatic schemes and visual compositions embodied the lure and failure of intellect, the delusions of reason.
 anathema
 [əˈnæθəmə] ## n. someone or something that is very strongly disliked           ##      ##  Nuance is anathema to his thinking, which is why he can maintain such fidelity to his ideas in a-hundred-and-forty-character bursts.
  anchor
  [ˈæŋkə] ## v. to secure firmly    ##                              5

  
   For Plato the art of music was so firmly anchored in moral and political reality that any alteration to music system would necessarily require a corresponding political shift.
 anecdote
 [ˈænɪkdəʊt]
n. a usually short narrative of an interesting, amusing, or biographical incident     
    
 Ricardo Piglia, the great Argentine writer who died in January, was fond of this anecdote, which he occasionally recited in interviews.
  animadversion
  [ˌænɪmæd'vɜ:ʃən]
n. a critical and usually censorious remark   
   
  These jokes were accompanied by Freudian-style commentary, along with random animadversions on aspects of sixties life, like Zip Codes, hippies, women who swear, and Marshall McLuhan.
 animate
 [ˈænɪmeɪt]
(1)adj. possessing or characterized by life        (2)v. to give spirit and support      
 galvanize, rouse, inspire
   
 He managed to animate conspiracy theories about the “real” birth certificate.
  annihilate
  [ə'naɪəlet]
v. to destroy completely      
 destroy
  
 Another New England Buddhist of the day was William Sturgis Bigelow, who brought back to Boston some twenty thousand works of Japanese art, and who called for a Catholic priest and asked that he annihilate his soul.
  anomaly
  [əˈnɒməli]
n. something that is unusual or unexpected   
 aberration
  
  It is self-evident that Trump prefers Twitter to any other means of communication, but his indifference to speechmaking is itself an anomaly.
 anonymous
 [əˈnɒnɪməs]
(1)adj. not named or identified         
(2)adj. lacking individuality, distinction, or recognizability     
 obscure
   
 Until then, they had been little more than anonymous bullies clattering around in white plastic.
  antagonistic
  [ænˌtægəˈnɪstɪk]
adj. showing dislike or opposition    
 adversarial, inimical
  
 If it were done by a Northerner, it will have an antagonistic effect,” she wrote. More precisely, it might have jeopardized support for the New Deal among members of Congress from the former Confederate states.
  antedate
  [
    ,æntɪ'det]
v. to be earlier or older than   
   
 In our age of anxiety about tiny pageant queens and helicopter parenting, we have perhaps forgotten that the archetype of the gifted child antedates reality television and kindergarten-admissions coaching.
  antediluvian
  [ˌæntidɪˈlu:viən]
adj. very old or old-fashioned    
 archaic
  
  Thomas basically embraced this antediluvian view of the Constitution, writing, “I am aware of no cases prior to the New Deal that characterized the power flowing from the Commerce Clause as sweepingly as does our substantial effects test.”
 anthropogenic
 [ˌænθrəpə'dʒnɪk]
adj. of, relating to, or resulting from the influence of human beings on nature    
    
  It has been shown repeatedly that it is just not possible to explain the recent warming without factoring in the rise in anthropogenic greenhouse gases.
 anticipate
 [ænˈtɪsɪpeɪt]
(1)v. to think of (something that will or might happen in the future)     (2)v. to do something before someone else        
 prefigure, foresee
   
 This was, Brown said, not the sort of speculative play one might anticipate from a mid-sized refiner like CVR.
  antithesis
  [ænˈtɪθəsɪs]
n. the exact opposite of something or someone   
   
 Trump is the antithesis of Obama: louche rather than gracious, parochial rather than worldly, conspiratorial rather than pragmatically intellectual.
  apathy
  ['æpəθɪ]
n. the feeling of not having much emotion or interest   
 passivity
  
 Over time that frustration turned to apathy and then anger, not just here but in Baltimore, Philadelphia, and other cities where ideology has given way to an uncomfortable reality.
  aplomb
  [ə'plɑm]
n. complete and confident composure or self-assurance        
   
 While both allow you to juggle multiple tasks with aplomb—the Xbox One has three distinct operating systems to handle everything, and does so more ably than the PS4.
   apocryphal
  [əˈpɒkrɪfl]
adj. of doubtful authenticity    
                        6
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
      
GRE    
       
  
   The Chemirocha-as-Jimmie-Rodgers story can seem apocryphal—it is too strange, too funny—but both Tracey and the Kipsigis themselves later corroborated and repeated it.
 apology
 [əˈpɒlədʒi]
(1)n. a statement saying that you are sorry about something     (2)n. something that is said or written to defend something that other people criticize   
    
 In 2006, for example, the Democratic Senate Majority Leader, Harry Reid, who in 1993 introduced a bill to eliminate birthright citizenship, issued a dramatic apology on the Senate floor.
  appetite
  ['æpitait]
n. a desire or liking for something      
   
 To read her, one must have an appetite for endless jumble sales and whist drives, and the interfering wisdom of dowagers and distressed gentlewomen.
  apposite
  [ˈæpəzɪt]
adj. very appropriate    
 fitting, germane
  
  If Pico’s ideal of a rapprochement between religions, and between religion and philosophy, is relevant to our agonies, it is apposite in a negative way: it invokes an opportunity lost, or at least disappearing from view.
 appreciate
 [ə'priʃɪet]
(1)v. to be grateful for    
(2)v. to understand the worth or importance of   
    
  It has become almost a cliché of basketball fandom to appreciate the ferocious intensity and reckless control of the Oklahoma City Thunder’s Russell Westbrook.
 apprehend
 [ˌæprɪˈhend]
(1)v. to grasp with the understanding    
(2)v. to anticipate especially with anxiety, dread, or fear     (3)v. arrest, seize   
    
  Shortly after he arrived, British authorities threatened to strip the Embassy of its diplomatic protections and apprehend him by force.
 approbation
 [ˌæprəˈbeɪʃn]
n. an act of approving formally or officially   
 adulation, commendation
   
  Now, though, the main historical point he made was that the Republican candidate might be “the next American President,” and that he, Peña Nieto, craved the respect and approbation of such a man.
 appropriate
 [əˈprəʊpriət]
(1)v. to take or use especially in a way that is illegal, unfair, etc.     (2)adj. right or suited for some purpose or situation    
 borrow
   
  To make those kinds of marks, you’d have to move quickly, which I think is appropriate, because the whole thing happened quite fast with Trump.
 approximate
 [ə'prɑksɪmət]
(1)adj. close in value or amount but not precise     (2)v. to bring near or close    
    
  The English syntax seems to approximate Hmong phrasing: its metamorphosis from another language, like the brutal self- transformations it expresses, is costly, ultimate, but also definitive.
 apt
 [æpt]
(1)adj. likely to do something   ...  
(2)adj. appropriate or suitable     
(3)adj. keenly intelligent and responsive    
    
 The circular imagery is apt for a play whose gimmick derives from concepts of curved space-time.
  arbitrary
  [ˈɑːrbətreri]
adj. not based on reason or evidence        
 capricious
  
  The five-thousand-word essay, which Graham published on his personal blog, in 2004, begins with the premise that there exist “moral fashions” that are both arbitrary and pernicious.
 arcane
 [ɑ:ˈkeɪn]
adj. secret or mysterious    
 esoteric, recondite, abstruse
   
 The threat of fake news was compounded by this sense that the role of the press had been ceded to an arcane algorithmic system created by private companies that care only about the bottom line.
  archaic
  [ɑ:ˈkeɪɪk]
adj. of or relating to ancient times    
 antediluvian, outdated
  
 New York is one of only thirteen states that has no provision for early voting, and instead employs the archaic practice of giving voters only two choices: show up at the polls on Election Day or vote by absentee ballot.
  archetypical
  [ɑ:kiˈtipikəl]
adj. being a perfect example of something    
 classic
                     7
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
      
GRE    
       
  
  The architecture of the Shanghai Bund was for decades presented as an archetypal symbol of abhorrent Western influence, which may be one of the reasons that these grand buildings were extolled for so many years.
  arousal
 [ə'raʊzl]
n. a state in which you feel excited or very alert   
    
  Studies of the brain suggest that the difference between sexual and competitive arousal may not be that large at all.
 arrest
 [əˈrest]
(1)v. to use the power of the law to take and keep    (2)v. to stop the progress or movement of   
(3)v. to attract and hold the attention of   
    
  Britain’s deteriorating economy after 1945 was mishandled by politicians who favored the manufacturing sector over the service sector: rather than attempting to arrest the decline of manufacturing, they should have promoted service industries.
 arrogant
 [ˈærəgənt]
adj. exaggerated or disposed to exaggerate one’s own worth or importance often by an overbearing manner    
 hubristic
   
  He was so arrogant that he didn't know what he didn't know, which is always a terrible thing.
 artful
  ['ɑrtfl]
adj. done with or showing artistic skill    
 shrewd
  
  It’s an artful variant of the familiar nightmare—familiar, indeed, as a fairy tale—of the amnesiac waking to a jigsaw-puzzle world to be reassembled by heroic effort.
 articulate
 [ɑr'tɪkjulet]
(1)v. to give clear and effective utterance to       (2)adj. clearly expressed and easily understood     
    
 We’re living in an age of superbly articulate, expressive, even poetic screenwriting—not necessarily in every movie, of course, but then it never was so.
  artifact
  ['ɑ:təˌfækt]
n. a simple object that was made by people in the past     
   
  The recovery of a wooden artifact so old and well preserved would be remarkable under any circumstances, but this one contained something curious.
 artificial
 [ˌɑ:tɪˈfɪʃl]
(1)adj. not sincere     
(2)adj. humanly contrived often on a natural model    
 spurious
   
  What’s more, Lehmann doesn’t only adulterate the drama with his comedic tones and twists—he denatures it with a sense of high artificial style that stands in effete contrast with the macho ruggedness of his protagonists’ personae.
 artless
 ['ɑ:tlɪs]
(1)adj. not false or artificial     
(2)adj. lacking art, knowledge, or skill    
 simplistic
   
  At the core of his art is an artlessness akin to conversational speech: time and again, he colors a line by breaking the honeyed tone and letting a folkish directness steal in.
 ascetic
 [əˈsetɪk]
adj. relating to having a strict and simple way of living that avoids physical pleasure    
    
 Where Paterson is ascetic and gaunt, murmuring poems to himself, Neruda is corpulent and unabashed, declaiming to his disciples and eager to gorge on the sins of the flesh.
  aspersion
  [əs'pɜ:ʃən]
n. defamation   
 slur
  
  Thomas Brattle, a thirty-four-year-old, Harvard-educated merchant, and among the wealthiest men in the colony, prefaced his remarks with a near apology: he would prefer to bite off his fingertips than cast aspersions on authority.
 assert
 [əˈsɜ:t]
(1)v. to state or declare positively and often forcefully or aggressively     
(2)v. the demonstrate the existence of   
    
 The university tried to get him to submit a patent for the unreleased cultivars, in order to assert its right to make use of Shaw’s intimate knowledge of the plants.
  astonish
  [əˈstɒnɪʃ]
v. to cause of feeling of great wonder or surprise in  ...  
   
 River Road Entertainment is one of the leading independent production companies known for developing, producing and financing distinguished feature films and documentaries that astonish, inspire, reveal and provoke.
  astounding
  [ə'staʊndɪŋ]
adj. causing a feeling of great surprise or wonder      
   
 Now their astounding influence-buying and efforts to keep the U.S. from embracing climate-change legislation have become more obvious.
   astringent
  [əˈstrɪndʒənt]
adj. having a sharp or bitter quality    
                         8
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
    
GRE    
       
    
  But it also earned astringent notice from some economic theorists, who saw in it a parable about the risks of paper money.
  at a premium
  phrase.      
   
 In this single volume, Kenny aims to survey for the general reader all of ancient philosophy; understandably, space in such a book is at a premium, and he is not to be faulted for minor omissions.
  at odds with
  phrase.  ...  
   
 The film falsely portrays President Lyndon B. Johnson as being at odds with Martin Luther King Jr. and even using the FBI to discredit him, as only reluctantly behind the Voting Rights Act of 1965 and as opposed to the Selma march itself.
  atypical
  [ˌeɪˈtɪpɪkl]
adj. irregular, unusual     
   
 In an era of TV tough guys, Kevin is fascinatingly atypical. He’s reactive rather than active, a labile, intensely emotional man who is shredded by his own inability to discern what’s real.
  audacious
  [ɔ'deʃəs]
adj. very confident and daring    
 striking
  
  In the early months of Mr Trump’s presidency, he had equal footing with the chief of staff, Reince Priebus, who was ousted last month, and launched some of the administration’s most audacious endeavours.
 augment
 [ɔ:gˈment]
v. to make greater, more numerous, larger, or more intense   
 extend, expand, enhance
   
 Various options have been under consideration for Afghanistan, including sending about 3,
800 more troops to augment the 8,
400 already there to train and assist local forces.
  auspicious
 [ɔ:ˈspɪʃəs]
adj. showing or suggesting that future success is likely      
 favorable
   
 The war was starting to wind down, and, with protests raging at home, it was not an auspicious time to be a military man.
  austere
 [ɔ'stɪr]
adj. simple or plain    
    
 The point of this austere approach is that you’re regularly required to ask what really needs doing, since there are only five slots.
  authoritative
  [ɔ:ˈθɒrətətɪv]
adj. having or preceding from authority     
 definitive, cogent
  
 His description of what he saw and heard is said to be the most authoritative and balanced account of the royal life of a famously tragic royal.
  autonomy
  [ɔ:ˈtɒnəmi]
n. the quality or state of being self-governing   
   
  Movements might have lost their leaders, gained force, and offered personal autonomy. Yet they hadn’t acquired the crucial thing —a good crack at success.
 available
 [əˈveɪləbl]
(1)adj. easy or possible to get or use      
(2)adj. present and able or willing to talk to someone    
    
 We have reviewed your request for a romantic comedy featuring middle-aged/senior actors and have prepared the following list of fifty available titles.
  avaricious
  [ˌævə'rɪʃəs]
adj. excessively acquisitive especially in seeking to hoard riches    
 rapacious
  
 With the exception of the giant and a wolf (a sensational Johnny Depp) who stalks and devours Little Red Riding Hood, these mean girls and their avaricious mom are the only genuine baddies.
  aversion
  [ə'vɜːʃən]
n. a strong feeling of not liking something   
   
  The Democratic aversion to helping big business means that subsidies are defensible only when they are aligned with a progressive cause, such as solar power.
 avert
 [əˈvɜ:t]
(1)v. to turn away or aside    
(2)v. to prevent from happening   
 forestall
   
  When Congress returns in September the House will have just 12 legislative days to raise the federal borrowing limit to avoid default — and the same amount of time to approve a spending deal to avert a government shutdown.
 awkward
 [ˈɔ:kwəd]
(1)adj. lacking dexterity or skill     
(2)adj. lacking the right proportions, size, or harmony of parts       (3)adj. causing embarrassment     
(4)adj. not easy to handle or deal with    
 ungainly
   
  Despite his awkward-looking posture, he managed to reach Mayweather with an irritating jab and, occasionally, a hard uppercut.
                      9
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
      
GRE    
       
awry
 [əˈraɪ]
(1)adv. not working correctly or happening in the expected way      (2)adj. not straight or neat    
    
  A consent decree allows the Justice Department to step in when one of the nation’s eighteen thousand law-enforcement departments goes seriously awry.
 badger
 [ˈbædʒə]
(1)v. to bother or annoy with many comments or questions    
(2)v. to ask or tell someone again and again to do something     
    
 Disappointment from certain members of its audience was so acute that they managed to badger the U.K.’s Advertising Standards Agency into launching an investigation into whether the game was falsely advertised in the run-up to its launch.
  baffle
 ['bæfl]
v. to confuse completely    
    
  Carlson’s journey from magazines to television may baffle some old colleagues, but it doesn’t baffle him.
 balanced
 [ˈbælənst]
(1)adj. in a fair and reasonable way     
(2)adj. calm and thinks clearly, even in a difficult situation      
    
 Indeed, the film is still fired up; if it makes no effort to take a balanced view, that is because the time for balance—to judge by the opinions expressed with such vehemence here—is long gone.
  balk at
  [bɔ:k]
phrase.   
   
 Yet I know a lot of people who have Netflix, Amazon Prime or cable with a lot of premium channels, who will balk at shelling out an extra six or seven or eight bucks a month for a more curated movie streaming service.
  balloon
  [bə'lun]
v. to become bigger quickly   
   
 Prices for vintage prints (those made by a photographer soon after he or she made the negative) so drastically ballooned in the 1990s that one of these photographs might fetch a hundred times as much as a nonvintage print of the same image.
  banal
 [bəˈnæl]
adj. lacking originality, freshness, or novelty        
 stale
   
 The premise may be a bit fantastical, but I’m more interested in human beings and, in a way, the banal side of a fantastic idea.
  baneful
  [ˈbeɪnfl]
adj. causing destructive or serious damage    
   
 The baneful consequences of an irresponsible mismanagement of the global economy, guided only by ambition for wealth and power, must serve as a summons to a forthright reflection on man: “man is not only a freedom which he creates for himself.
  banish
  ['bænɪʃ]
v. to send away   
 expel, oust
  
 Then I realized that perhaps the Lord wants me to take this job so that I can banish housing and urban development from the earth.
  banter
  [ˈbæntə]
n. good-natured and usually witty and animated joking   
 raillery
  
  The atmosphere was at its most elated on Fridays, when a communal sense of liberation descended, so that proximity could lead to banter.
 bargain
 [ˈbɑ:gən]
v. to discuss an agreement or price in order to make it more appealing
    
    
  Because of the Mackay doctrine, workers in the U.S. are ultimately dependent upon employers’ willingness to bargain in good faith.
 barrier
 ['bærɪə]
n. something that prevents or blocks movement from one place to another   
    
 Their defense of officers’ working conditions is a barrier to investigating misconduct claims and getting rid of those who break the rules.
  baseless
 [ˈbeɪsləs]
adj. not true and is not based on facts     
 unfounded, untenable
   
 Sanders urged the ESPN anchor to “do her homework” on Trump before making baseless allegations.
  bedrock
  [ˈbedrɒk]
n. basis   
 foundation
  
 The first sign of trouble came with the President-elect’s phone call with the leader of Taiwan, a move that broke the diplomatic protocol that has served as the bedrock of Sino-American relations for four decades.
  beguile
 [bɪ'ɡaɪl]
v. to trick or deceive   
    
  The Queens producer’s songs beguile with their singular focus, as on her self-titled E.P. of whispery slow-blooming dance tunes.
 beholden
  [bɪ'holdən]
adj. being under obligation for a favor or gift  ...   
 indebted
                            10
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
    
GRE    
       
    
   Listen to your constituents, and don’t become beholden to wealthy lobbyists.
 belabor
 [bɪ'lebə]
(1)v. to repeat or stress too much or too often       (2)v. to attack or criticize   
 overemphasize
   
  Everything was exquisitely timed, Schumer didn’t belabor the point, and it was sweet and funny to see a middle-aged man with a bit of a paunch looking as vulnerable as he did beside the star.
 belie
 [bɪˈlaɪ]
(1)v. to show to be false or wrong   ...     
(2)v. disguise   
(3)v. to present an appearance not in agreement with  ...  
 mask
   
 The public had become transfixed by the tribe’s prosperity, which belied the images of American Indians that could be traced back to the brutal first contact with whites—the original sin from which the country was born.
  belligerent
 [bi'lidʒərənt]
adj. feeling or showing readiness to fight    
 pugnacious
   
  In asymmetric warfare, belligerent propaganda—not to mention nuclear-tipped ballistic missiles—is a useful tool.
 bemoan
  [bɪˈməʊn]
v. to complain about   
   
 “This will be my first total solar eclipse,” Lincoln told me, bemoaning the fact that he had been in the wrong place to see both the annular eclipse of 1831, on his twenty-second birthday, and the dramatic total eclipse of 1834.
  beneficence
  [bɪ'nefɪsns]
n. a charitable act or gift      
 altruism
  
  The philosophers’ God was not necessarily identical to the God of Christianity, but he had some reassuringly familiar attributes, such as beneficence and providential oversight of the world.
 benevolent
 [bəˈnevələnt]
adj. organized to do good things for other people    
 altruistic, magnanimous
   
 The objects and purposes of the federation shall be social, literary, historical, monumental, benevolent and honorable in every degree, without any political signification whatever.
  benign
  [bɪ'naɪn]
adj. showing kindness and gentleness    
 innocuous, anodyne
  
 Most crucially, he never faced the dehumanizing weapons and tactics of modern asymmetric warfare, in which death can arrive, unseen and unanticipated, even from the most seemingly safe or benign of encounters.
  betoken
  [bɪˈtəʊkən]
v. to show   
 signify
  
  The wooden-house set pieces and multi-hued backdrops that fly gracefully in and out betoken the humble, homespun lives outlined in the stories of Sholom Aleichem, on which the musical is based.
 bias
 [ˈbaɪəs]
(1)n. a tendency to believe that some people, ideas, etc., are better than others that usually results in treating some people unfairly     (2)n. a strong interest in something or ability to do something   
    
 As we process, simultaneously, the enormous historical bias of the movie industry toward whiteness and the uneven progress it’s making toward better representation, two opposite ideas are forced to coexist.
  blameless
  [ˈbleɪmləs]
(1)adj. has not done anything wrong      
 unimpeachable
  
  The stories served to remind the court of what had been lost, but they also must have reassured Roof that these were indeed the type of blameless, decent people whom he said he had set out to hurt.
 bland
 [blænd]
(1)adj. not interesting or exciting     
(2)adj. showing no emotion, concern, etc.      
 insipid
   
  People learned to be content with patched clothes, bland meals of leftovers, and serviceable if unromantic unions. But now, she said, economic progress had diversified people’s choices: “Money buys options.
 blemish
 ['blɛmɪʃ]
(1)v. to spoil by a flaw    
(2)n. a mark that makes something imperfect or less beautiful       
 defect
   
  One great blemish in the popular mind of America, and the prolific parent of an innumerable brood of evils, is Universal Distrust.
 blighted
  ['blaitid]
adj. in a badly damaged or deteriorated condition    
   
  As I read the novel again, I thought of “Rosemary’s Baby,” a contemporaneous tale of a New York woman with a blighted womb trapped in a bad marriage and a piece of prime real estate.
  blunt
   [blʌnt]
(1)adj. having a thick edge or point     (2)adj. being straight to the point      
                            11
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
      
GRE    
       
  
   She was a hero almost without detractors; she was often blunt, but she personified courage, which is what it took for a gay person to bring a public legal claim for equality.
 boast
 [bəʊst]
n. a statement in which you express too much pride in yourself or in something you have, have done, or are connected to in some way       
 brandish
   
 Over the past two decades, the Brooklyn rapper reached the apex of an art form that was built on flamboyant, oftentimes impossible boasts.
  bogus
 ['bogəs]
adj. not real or genuine    
    
  This third swing at justifying Trump’s tweet is as bogus as the first two.
 bolster
  [ˈbəʊlstə]
v. to give support to   
 buttress, prop up
  
  Thursday’s snap general election, which Theresa May, the Conservative Prime Minister, had called to bolster her party’s slim minority in the House of Commons, had turned into something of a calamity for her party and a humiliation for her personally.
 bookish
 ['bʊkɪʃ]
adj. more interested in reading books and studying than doing more physical activities      
    
 Mattis grew up in Richland, Washington, in a bookish household without a television set.
  boon
  [bu:n]
n. something pleasant or helpful      
 benefit
  
 In 2014, it imposed sanctions on American and European food imports, which led to both an increase in consumer food prices and a boon for the domestic agriculture industry.
  boundary
 [ˈbaʊndri]
n. something that indicates or fixes a limit or extent   
    
  When that moment of acceptance first happened, I crossed through the mental boundary that separates pedestrian from driver.
 brake
 [breɪk]
n. something used to slow down or stop movement or activity       
    
 Defenders of the rule portray it as a way of furthering the founders’ vision of the Senate as a brake on a runaway republic, where opinion might sway the government to act too quickly or absolutely.
  brandish
  ['brændɪʃ]
v. to exhibit in a ostentatious or aggressive manner   
 boast
  
 Pina bausch became famous as the master of dance theatre, in which the performers are less likely to dance than to brandish guns or take baths or swing from ropes.
  breakthrough
  [ˈbreɪkθru:]
n. a sudden increase in knowledge, understanding, etc.   
   
 The inaugural breakthrough in the field of hearing restoration occurred in the late nineteen-eighties, when two researchers discovered that the ears of young chickens do something that human ears don’t.
  breathtaking
  ['brɛθtekɪŋ]
adj. very exciting      
   
 Dietrich’s onscreen persona became refined to a degree of breathtaking precision, and expanded to a historical—even a philosophical—scope.
  brevity
 ['brɛvəti]
n. the use of few words to say something   
    
  Lydia Davis’s work combines aphoristic brevity with emotional expansiveness.
 bridle
  ['braɪdl]
v. to restrain, check, or control with or as if with a bridle   
   
 Such methods, especially with respect to the researcher, were considered to restrain those incursions of subjectivity whose unbridled expression was thought to corrupt research.
  brook
  [brʊk]
v. to allow to exist or happen   
 tolerate
  
 Members of the union’s negotiating team insisted on several changes to the company’s proposal before they would support it, making it clear that they would brook no compromise.
  bucolic
  [bju:ˈkɒlɪk]
adj. of or relating to the country or country life    
 pastoral
  
 Hugo made portraits of children of a new generation in villages around Rwanda and South Africa, posing each one in a bucolic setting, where the purity of nature and the innocence of youth evoke a kind of children’s idyll.
  budding
  [ˈbʌdɪŋ]
adj. being in an early stage of development     
 nascent
  
  This film, set after the explosion of Earth, depicts the budding romance between several human consciousnesses that have been uploaded to the Cloud.
                         12
                     (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
    
    
GRE    
       
  buoy
  [bɔɪ]
v. to cause to feel happy or confident    
 help
  
 After decades of reporting on the ways in which the Mafia influences Sicilian life, Viviano has little patience for anti-Mafia crusaders who exploit the Cosa Nostra’s historic reputation in order to buoy their own.
  burdensome
  [ˈbɜ:dnsəm]
adj. causing difficulty or worry    
 onerous
  
 I was not like the children in folktales: burdensome mouths to feed, nuisances to be corrected, problems so severe that they were abandoned to the forest.
  burgeon
  ['bɜːdʒən]
v. to grow or develop quickly     
 expand, flourish
  
  Folding tables burgeon with cables, clipboards, and fast-food impedimenta.
 businesslike
 ['bɪznəs'laɪk]
adj. having or showing qualities that are considered good in business      
 no-nonsense
   
 The Rangers are known to fans as the National Hockey League's most businesslike team, so perhaps we shouldn't have been surprised to find that they go about a postgame session, too, in businesslike fashion.
  buttress
 [ˈbʌtrəs]
v. to support, strengthen, or defend   
 bolster
   
 Laws that mandate ultrasound viewing and parental consent seem innocuous, but they buttress a punitive political strategy.
  bypass
  [ˈbaɪpɑ:s]
v. to avoid or ignore especially to get something done quicker   
 circumvent, skirt
  
  The hope is that, just as cell phones bypassed the network of telephone lines, solar panels will enable many rural consumers to bypass the electric grid.
 callous
 [ˈkæləs]
adj. not feeling or showing any concern about the problems or suffering of other people      
 heartless
   
 Indeed, the only real puzzle of the Kushner trip is which particular Trumpian political vice it best illustrates: deluded self- aggrandizement or a callous indifference to other people’s lives.
  callow
 [ˈkæləʊ]
adj. lacking adult sophistication     
    
  Krauss, with his disconcertingly boyish looks and his sophomoric attempts to seem thoughtful, is a callow sociopath.
 calumny
 [ˈkæləmni]
n. an untrue statement that is made to damage someone’s reputation    
 defamation
   
 Throughout the week, the President repeated his calumny that he lost the popular vote only because millions of “illegals” voted for Hillary Clinton.
  camaraderie
  [ˌkæməˈrɑ:dəri]
n. a feeling of good friendship among the people in a group      
 solidarity
  
  Although I enjoy the camaraderie, beware any fellow-foragers who happen to stray near me on one particular, sacred day.
 candid
 ['kændɪd]
adj. expressing opinions and feelings in an honest and sincere way     
    
 It would be naïve to treat remarks made in diaries or personal letters as giving especially candid access to historical truth or even as being expressions of the writer’s true state of mind.
  canned
  [kænd]
adj. not original or special     
 formulaic
  
 Jaime Javier Rodriguez notes that popular art forms often conceal a daunting complexity: frequently what appears canned becomes intricate and challenging when closely examined.
  canny
  [ˈkæni]
adj. very clever and able to make intelligent    
 shrewd, deft
  
  Steidl prides himself on being a canny businessman: he has always wanted to make money, and funnels it back into the business when he does.
 capricious
 [kəˈprɪʃəs]
adj. changing often and quickly      
 unpredictable, impulsive, cavalier, versatile
   
  Blocking the rule remains an administration priority, no matter how arbitrary, capricious and harmful that would be.
 captivate
 [ˈkæptɪveɪt]
v. to attract and hold the attention of by being interesting, pretty, etc.    
 enamor
   
  Fans of a certain age can remember when teen-age players would burst onto the scene and quickly captivate audiences at major tournaments.
                                  13
               (OG+150+PP2+PPO)+    1100                                              The New Yorker, Nytimes, The Economist, The Washingtong Post GRE                    “    ”     
  
  
GRE    
      
capture
[ˈkæptʃə]
v. to catch   
secure
  
Korben wants to be the first filmmaker to capture physical, visual evidence of the metaphysical realm—and the ghosts that he wants to capture on film are his own.
caricature
['kærɪkətjʊə]
n. someone or something that is very exaggerated in a funny or foolish way      
  
Though his practice was rooted in the French fin-de-siècle practice of caricature, with its emphasis on elegance and animation, more than on Daumier-like grit and grime, Max gave his caricatures a particularly English kind of narrative flair
castigate
[ˈkæstɪgeɪt]
v. to criticize harshly     
chastise
  
For a while, he used the image of the Confederate flag onstage, only later to castigate himself for how oblivious this was, calling himself “downright stupid” for doing something that would cause many people pain.
caterwaul
[ˈkætəwɔ:l]
v. to make a very loud and unpleasant sound          
shriek
  
At 55, he’s still capable of banshee wails and his scale-climbing caterwaul, which I imagined could be both a stress reliever or downright stressful given his facial expressions.
cede to
[si:d]
phrase.   
left to
  
Because movie studios, under pressure to generate international sales, have favored big-budget pictures with fantasy plots, the representation of everyday domestic life has largely been ceded to other media, such as television and literature.
celebrate
[ˈselɪbreɪt]
v. to praise   
  
Publicity has the power to show “Klansmen” for what they really are: a collection of sad, dysfunctional, bigots who both celebrate their social exclusion and plot the downfall of those who exclude them.
celerity
[sɪ'lerɪtɪ]
n. rapidity of motion or action      
dispatch
  
“Die Meistersinger von Nürnberg” is one of James Levine’s specialties—he imbues it with a Mozartean lightness that can make the performance’s five-hour span pass by with an agreeable celerity.
censor
['sensə]
(1)v. to examine in order to suppress or delete anything considered objectionable    
(2)n. a person who supervises conduct and morals    
  
A red emergency light spins in court when a censor at the judge’s elbow hits the mute button to prevent someone from spilling national security secrets.
censure
[ˈsenʃə]
n. official strong criticism   
reprehend
  
Rhode Island’s two Democratic congressmen have co-sponsored a resolution to formally censure President Trump for his comments about the recent violence in Charlottesville, Virginia.
centralize
[ˈsentrəlaɪz]
(1)v. to bring together at a single point or place    (2)v. to bring under the control of one authority    
  
In any liberal democracy, the ultimate guardian of decency and civil liberties is an active civil society, which can push back against efforts to mislead the public, flout accepted norms, and centralize power.
cerebral
[sə'ribrəl]
(1)adj. of or relating to the brain      (2)adj. intellectual and not emotional    
  
They are unabashedly cerebral: brilliant composers and classically trained musicians slumming it in a guitar band.
chagrin
[ˈʃægrɪn]
n. a feeling of being frustrated or annoyed because of failure or disappointment   
vexation
  
Part of the deal is that we still feign chagrin or incredulity (or both) when a pop star announces another reinvention.
challenging
[ˈtʃælɪndʒɪŋ]
(1)adj. arousing competitive interest, thought, or action       (2)adj. invitingly provocative        
  
He hopes to speak at more challenging venues, such as a Jewish-history museum.
champion
[ˈtʃæmpiən]
v. to fight or speak publicly in support of   
defend, espouse, support
  
Some did champion the movie, including leading voices like Roger Ebert and Pauline Kael. But many others savaged it, criticizing Bonnie and Clyde as a bloody, empty project that degraded modern cinema.
chaotic
[keɪˈɒtɪk]
adj. in a state of complete disorder and confusion    